---
kind: other
id: Methods.T:Autodesk.Revit.UI.Events.DisplayingOptionsDialogEventArgs
source: html/9cdaac68-358a-fc54-b1c3-01eb99bbcac8.htm
---
# DisplayingOptionsDialogEventArgs Methods

Add tab to option dialog with tab name and handler information.